SPedt_!/src/Documents/ЗаказыДляТранзита/ЗаказыДляТранзита.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказыДляТранзита</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСОрганизаторами</registerRecords>
  <registerRecords>InformationRegister.ДанныеЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.Транзит</registerRecords>
  <registerRecords>AccumulationRegister.НеВыгруженноНаСайт</registerRecords>
  <registerRecords>AccumulationRegister.Приход</registerRecords>
  <attributes>
    <name>Организатор</name>
    <type>
      <types>CatalogRef.Организаторы</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПоДокументу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Оплачено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокЗаказов</name>
    <attributes>
      <name>Посылка</name>
      <type>
        <types>CatalogRef.Посылки</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоХранения</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктВыдачи</name>
      <type>
        <types>CatalogRef.ТочкиРаздачи</types>
      </type>
    </attributes>
    <attributes>
      <name>ШК</name>
      <type>
        <types>CatalogRef.Мегаордера</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПриема</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокКоробок</name>
    <attributes>
      <name>Коробка</name>
      <type>
        <types>CatalogRef.Коробки</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоХранения</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктВыдачи</name>
      <type>
        <types>CatalogRef.ТочкиРаздачи</types>
      </type>
    </attributes>
    <attributes>
      <name>ШК</name>
      <type>
        <types>CatalogRef.Мегаордера</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПриема</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SPedt_!/src/AccumulationRegisters/НеВыгруженноНаСайт/НеВыгруженноНаСайт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>НеВыгруженноНаСайт</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DefinedType.Заказ100сп</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПартияДляОбмена</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПунктВыдачи</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

SPedt_!/src/AccumulationRegisters/Приход/Приход.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Приход</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Габарит</name>
    <type>
      <types>CatalogRef.Габариты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организатор</name>
    <type>
      <types>CatalogRef.Участники</types>
      <types>CatalogRef.Организаторы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Покупка</name>
    <type>
      <types>DefinedType.ТипыЗаказа</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Участник</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
      <types>CatalogRef.Участники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Коробка</name>
    <type>
      <types>CatalogRef.Коробки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипПрихода</name>
    <type>
      <types>EnumRef.ТипыПриходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтдельнымМестом</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПунктВыдачи</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

SPedt_!/src/AccumulationRegisters/ВзаиморасчетыСОрганизаторами/ВзаиморасчетыСОрганизаторами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыСОрганизаторами</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организатор</name>
    <type>
      <types>CatalogRef.Организаторы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРасчетов</name>
    <type>
      <types>DocumentRef.ЗаказыДляТранзита</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

SPedt_!/src/AccumulationRegisters/Транзит/Транзит.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Транзит</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПокупкаСсылка</name>
    <type>
      <types>DefinedType.ТипыЗаказа</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Габарит</name>
    <type>
      <types>CatalogRef.Габариты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Точка</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.Движение</types>
      <types>DocumentRef.ФормированиеКоробки</types>
      <types>DocumentRef.КорректировкаЗаписейРегистров</types>
      <types>DocumentRef.ОтправлениеТранзита</types>
      <types>DocumentRef.ЗаказыДляТранзита</types>
      <types>DocumentRef.Приходная</types>
      <types>DocumentRef.ПоступлениеПристроя</types>
      <types>DocumentRef.РазборКоробки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

SPedt_!/src/Documents/ЗаказыДляТранзита/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим) 
	Движения.НеВыгруженноНаСайт.Записывать = Истина;  
	Движения.Приход.Записывать = Истина;
	Движения.ВзаиморасчетыСОрганизаторами.Записывать = Истина;
	Движения.Транзит.Записывать = Истина; 
	Движения.ДанныеЗаказов.Записывать = Истина;

	ГабаритПередачи = константы.ТарифПередачиЗаказовНаТранзит.Получить();
	ТранзитныйПункт = Константы.ПунктВыдачиТранзита.Получить();     
	СтоимостьЗаказа = константы.СтоимостьПередачиЗаказовНаТранзит.Получить();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказыДляТранзитаСписокЗаказов.Посылка КАК Посылка,
		|	ЗаказыДляТранзитаСписокЗаказов.МестоХранения КАК МестоХранения,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказыДляТранзитаСписокЗаказов.Посылка) КАК Количество,
		|	ЗаказыДляТранзитаСписокЗаказов.ДатаПриема КАК ДатаПриема
		|ИЗ
		|	Документ.ЗаказыДляТранзита.СписокЗаказов КАК ЗаказыДляТранзитаСписокЗаказов
		|ГДЕ
		|	ЗаказыДляТранзитаСписокЗаказов.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказыДляТранзитаСписокЗаказов.МестоХранения,
		|	ЗаказыДляТранзитаСписокЗаказов.Посылка,
		|	ЗаказыДляТранзитаСписокЗаказов.ДатаПриема
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаказыДляТранзитаСписокКоробок.Коробка,
		|	ЗаказыДляТранзитаСписокКоробок.МестоХранения,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказыДляТранзитаСписокКоробок.Коробка),
		|	ЗаказыДляТранзитаСписокКоробок.ДатаПриема
		|ИЗ
		|	Документ.ЗаказыДляТранзита.СписокКоробок КАК ЗаказыДляТранзитаСписокКоробок
		|ГДЕ
		|	ЗаказыДляТранзитаСписокКоробок.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказыДляТранзитаСписокКоробок.МестоХранения,
		|	ЗаказыДляТранзитаСписокКоробок.Коробка,
		|	ЗаказыДляТранзитаСписокКоробок.ДатаПриема";
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		//Движение = Движения.Транзит.Добавить();
		//Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		//Движение.Период = Дата;
		//Движение.ПокупкаСсылка = Выборка.Посылка;
		//Движение.МестоХранения = Выборка.МестоХранения;
		//Движение.Габарит = ГабаритПередачи;
		//Движение.Точка = ТранзитныйПункт;
		//Движение.Партия = Ссылка;
		//Движение.Количество = Выборка.Количество;
		Движение = Движения.НеВыгруженноНаСайт.Добавить();
		Движение.Период = Дата;
		Движение.Заказ = Выборка.Посылка;
		Движение.Партия = ссылка;
		Движение.ПунктВыдачи =  ТранзитныйПункт;
		Движение.МестоХранения = выборка.МестоХранения;
		Движение.Количество = 1;
		
		
		
		Движение = Движения.Приход.Добавить();
		Движение.Период = Дата;
		Движение.Габарит = ГабаритПередачи;
		Движение.МестоХранения = Выборка.МестоХранения;
		Движение.Организатор = Организатор;
		Движение.Покупка = Выборка.Посылка;
		Движение.Коробка = Справочники.Коробки.БезКоробки;
		Движение.ТипПрихода = Перечисления.ТипыПриходов.НаТранзитОтОрганизатора;
		Движение.ОтдельнымМестом = Ложь;
		Движение.ПунктВыдачи = ТранзитныйПункт;
		Движение.Количество = 1;
		Движение.Сумма = СтоимостьЗаказа;


		Движение = Движения.ДанныеЗаказов.Добавить();
		Движение.Партия = Ссылка;
		Движение.Заказ = Выборка.Посылка;
		Движение.Габарит = ГабаритПередачи;
		Движение.Количество = 1;
		Движение.ОтдельнымМестом = Ложь;
		Движение.ДатаПриема = Выборка.ДатаПриема;
		Движение.Коробка = 1;
		Движение.НеОплачен = Ложь;
		Движение.МестоХранения = ВЫборка.МестоХранения;
		
		
		
	КонецЦикла;

		
		Движение = Движения.ВзаиморасчетыСОрганизаторами.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организатор = Организатор;
		Движение.ДокументРасчетов = Ссылка;
		Движение.Сумма = СуммаПоДокументу;
		
		Если Оплачено >0 Тогда
			Движение = Движения.ВзаиморасчетыСОрганизаторами.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Организатор = Организатор;
			Движение.ДокументРасчетов = Ссылка;
			Движение.Сумма = Оплачено;
	    КонецЕсли;

	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ДанныеЗаказов
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры


Процедура ПосчитатьСумму() Экспорт
	ВсегоЗаказов =  СписокЗаказов.Количество() +СписокКоробок.Количество();
	стоимость = Константы.СтоимостьПередачиЗаказовНаТранзит.Получить();
	СуммаПоДокументу = ВсегоЗаказов * стоимость;
	СуммаПоДокументу = ?(СуммаПоДокументу < 50, 50,СуммаПоДокументу);
КонецПроцедуры	


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ПосчитатьСумму();
КонецПроцедуры
